In [3]:
# dataFrame的创建方式
import pandas as pd
# 通过Series来创建
s1 = pd.Series([1,2,3,4,5])
s2 = pd.Series([6,7,8,9,10])
df = pd.DataFrame({'第1列':s1,'第2列':s2})
df
# 通过字典创建
df = pd.DataFrame({
    'name':['tom','jack','alice','bob','allen'],
    'age':[15,17,20,22,30],
    'score':[30,40,50,60,70]
},index=[1,2,3,4,5],columns=['name','score','age'])
df

    name  score  age
1    tom     30   15
2   jack     40   17
3  alice     50   20
4    bob     60   22
5  allen     70   30

In [6]:
# DataFrame的属性
print('行索引：')
print(df.index)
print('列标签：')
print(df.columns)
print('值：')
print(df.values)

行索引：
Index([1, 2, 3, 4, 5], dtype='int64')
列标签：
Index(['name', 'score', 'age'], dtype='object')
值：
[['tom' 30 15]
 ['jack' 40 17]
 ['alice' 50 20]
 ['bob' 60 22]
 ['allen' 70 30]]

In [9]:
print('维度：',df.ndim)
print('形状：',df.shape)
print('个数：',df.size)
print(df.dtypes)

维度： 2
形状： (5, 3)
个数： 15
name     object
score     int64
age       int64
dtype: object

In [10]:
# 行内转置
print(df.T)

         1     2      3    4      5
name   tom  jack  alice  bob  allen
score   30    40     50   60     70
age     15    17     20   22     30

In [15]:
# 获取元素 loc iloc at iat
# 某行
print(df.loc[1])
print(df.iloc[0])

name     tom
score     30
age       15
Name: 1, dtype: object
name     tom
score     30
age       15
Name: 1, dtype: object

In [17]:
# 某列
print(df.loc[:,'name'])
print(df.iloc[:,0])

1      tom
2     jack
3    alice
4      bob
5    allen
Name: name, dtype: object
1      tom
2     jack
3    alice
4      bob
5    allen
Name: name, dtype: object

In [22]:
print(df)
# 单个元素
print(df.at[3,'name'])
print(df.iat[2,0])
print(df.loc[3,'name'])
print(df.iloc[2,0])

    name  score  age
1    tom     30   15
2   jack     40   17
3  alice     50   20
4    bob     60   22
5  allen     70   30
alice
alice
alice
alice

In [29]:
# 获取单列数据
print(df['name'])
print(type(df['name']))
print(df.name)
print(type(df.name))
print(df[['name']])
print(type(df[['name']]))
df[['name']]

1      tom
2     jack
3    alice
4      bob
5    allen
Name: name, dtype: object
<class 'pandas.core.series.Series'>
1      tom
2     jack
3    alice
4      bob
5    allen
Name: name, dtype: object
<class 'pandas.core.series.Series'>
    name
1    tom
2   jack
3  alice
4    bob
5  allen
<class 'pandas.core.frame.DataFrame'>

    name
1    tom
2   jack
3  alice
4    bob
5  allen

In [30]:
# 多列数据的获取
print(df[['name','score']])

    name  score
1    tom     30
2   jack     40
3  alice     50
4    bob     60
5  allen     70

In [32]:
# 查看部分数据
print(df.head(2))
print(df.tail(2))

   name  score  age
1   tom     30   15
2  jack     40   17
    name  score  age
4    bob     60   22
5  allen     70   30

In [37]:
# 使用索引筛选数据
df[df.score > 40]
df[(df.score > 40) | (df.age >20)]

    name  score  age
3  alice     50   20
4    bob     60   22
5  allen     70   30

In [42]:
# 随机抽样
df.sample(3)

    name  score  age
2   jack     40   17
5  allen     70   30
4    bob     60   22

In [ ]:
df = pd.DataFrame(
    {
        "name":["tom",'jack','alice','bob','allen'],
        "age":[15,17,20,26,30],
        "score":[60.5,80,30.6,70,83.5]
    },index=[1,2,3,4,5],columns=["name","score","age"]
)

In [57]:
df.head()
df.tail(3)
df.isin(['jack',20]) # 只要满足一个就是True
# 是否有缺失值
df.isna()
# 某一列的总和
print(df.score.sum())
# 最大值
print(df.score.max())
# 最小值
print(df.score.min())
# 平均值
print(df.score.mean())
# 中位数
print(df.score.median())
# 标准差
print(df.score.std())
# 方差
print(df.score.var())
# 众数
print(df.age.mode())

385.1
83.5
30.6
64.18333333333334
65.25
19.037375519400424
362.4216666666666
0    15
Name: age, dtype: int64

In [56]:
df = pd.DataFrame(
    {
        "name":["tom","tom",'jack','alice','bob','allen'],
        "age":[15,15,15,20,26,30],
        "score":[60.5,60.5,80,30.6,70,83.5]
    },index=[1,2,3,4,5,6],columns=["name","score","age"]
)

In [61]:
print(df.score.quantile([0.25,0.75])) # 分位数
print(df.describe())

0.25    60.5
0.75    77.5
Name: score, dtype: float64
           score        age
count   6.000000   6.000000
mean   64.183333  20.166667
std    19.037376   6.493587
min    30.600000  15.000000
25%    60.500000  15.000000
50%    65.250000  17.500000
75%    77.500000  24.500000
max    83.500000  30.000000

In [64]:
print(df.count()) # 每一列非缺失值的个数

name     6
score    6
age      6
dtype: int64

In [65]:
print(df.value_counts()) # 出现的次数

name   score  age
tom    60.5   15     2
alice  30.6   20     1
allen  83.5   30     1
bob    70.0   26     1
jack   80.0   15     1
Name: count, dtype: int64

In [66]:
print(df.drop_duplicates())  # 去除重复行

    name  score  age
1    tom   60.5   15
3   jack   80.0   15
4  alice   30.6   20
5    bob   70.0   26
6  allen   83.5   30

In [68]:
print(df.duplicated(subset=['age'])) # 判断是否有重复值

1    False
2     True
3     True
4    False
5    False
6    False
dtype: bool

In [69]:
df.sample(2) # 随机抽样

    name  score  age
6  allen   83.5   30
4  alice   30.6   20

In [70]:
print(df.replace(15,30)) # 值替换

    name  score  age
1    tom   60.5   30
2    tom   60.5   30
3   jack   80.0   30
4  alice   30.6   20
5    bob   70.0   26
6  allen   83.5   30

In [73]:
df.cumsum()  # 累加
df.cummin(axis=0)

    name  score  age
1    tom   60.5   15
2    tom   60.5   15
3   jack   60.5   15
4  alice   30.6   15
5  alice   30.6   15
6  alice   30.6   15

In [74]:
# 排序
print(df.sort_index(ascending=False)) # 按照索引排序

    name  score  age
6  allen   83.5   30
5    bob   70.0   26
4  alice   30.6   20
3   jack   80.0   15
2    tom   60.5   15
1    tom   60.5   15

In [75]:
# 按照值排序
print(df.sort_values(by=['score'],ascending=False))

    name  score  age
6  allen   83.5   30
3   jack   80.0   15
5    bob   70.0   26
1    tom   60.5   15
2    tom   60.5   15
4  alice   30.6   20

In [76]:
print(df.sort_values(by=['score','age'],ascending=[False,True]))

    name  score  age
6  allen   83.5   30
3   jack   80.0   15
5    bob   70.0   26
1    tom   60.5   15
2    tom   60.5   15
4  alice   30.6   20

In [79]:
df.nlargest(2,columns=['score','age'])
df.nsmallest(2,columns=['score','age'])

    name  score  age
4  alice   30.6   20
1    tom   60.5   15

In [90]:
'''
案例1：学生成绩分析
场景：某班级的学生成绩数据如下，请完成以下任务：
1. 计算每位学生的总分和平均分。
2. 找出数学成绩高于90分或英语成绩高于85分的学生。
3. 按总分从高到低排序，并输出前3名学生。
'''
data = {
    '姓名': ['张三', '李四', '王五', '赵六', '钱七'],
    '数学': [85, 92, 78, 88, 95],
    '英语': [90, 88, 85, 92, 80],
    '物理': [75, 80, 88, 85, 90]
}
scores = pd.DataFrame(data)
# 每位学生的总分
scores['总分'] = scores[['数学','英语','物理']].sum(axis=1)
# 每位学生的平均分
scores['平均分'] = scores['总分'] / 3
scores['平均分2'] = scores[['数学','英语','物理']].mean(axis=1)
# 数学成绩高于90分或英语成绩高于85分的学生
scores[(scores.数学 > 90) | (scores.英语 > 85)]
# 总分从高到低排序，并输出前3名学生
scores.sort_values('总分',ascending=False).head(3)
scores.nlargest(3,columns=['总分'])

   姓名  数学  英语  物理   总分        平均分       平均分2
3  赵六  88  92  85  265  88.333333  88.333333
4  钱七  95  80  90  265  88.333333  88.333333
1  李四  92  88  80  260  86.666667  86.666667

In [96]:
'''
案例2：销售数据分析
场景：某公司销售数据如下，请完成以下任务：
1. 计算每种产品的总销售额（销售额 = 单价 × 销量）。
2. 找出销售额最高的产品。
3. 按销售额从高到低排序，并输出所有产品信息。
'''
data = {
    '产品名称': ['A', 'B', 'C', 'D'],
    '单价': [100, 150, 200, 120],
    '销量': [50, 30, 20, 40]
}
df = pd.DataFrame(data)
df['总销售额'] = df['单价'] * df['销量']
df
df.nlargest(1,columns=['总销售额'])
df.sort_values('总销售额',ascending=False)

  产品名称   单价  销量  总销售额
0    A  100  50  5000
3    D  120  40  4800
1    B  150  30  4500
2    C  200  20  4000

In [104]:
'''案例3：电商用户行为分析
场景：某电商平台的用户行为数据如下，请完成以下任务：
1. 计算每位用户的总消费金额（消费金额 = 商品单价 × 购买数量）
2. 找出消费金额最高的用户，并输出其所有信息
3. 计算所有用户的平均消费金额（保留2位小数）
4. 统计电子产品的总购买数量
'''
data = {
    '用户ID': [101, 102, 103, 104, 105],
    '用户名': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    '商品类别': ['电子产品', '服饰', '电子产品', '家居', '服饰'],
    '商品单价': [1200, 300, 800, 150, 200],
    '购买数量': [1, 3, 2, 5, 4]
}
df = pd.DataFrame(data)
# 总消费金额
df['总消费金额'] = df['商品单价'] * df['购买数量']
# 消费金额最高的用户
df.nlargest(1,columns=['总消费金额'])
df['总消费金额'].mean()
# 电子产品的总购买数量
df[df['商品类别'] == '电子产品']['购买数量'].sum()
df

   用户ID      用户名  商品类别  商品单价  购买数量  总消费金额
0   101    Alice  电子产品  1200     1   1200
1   102      Bob    服饰   300     3    900
2   103  Charlie  电子产品   800     2   1600
3   104    David    家居   150     5    750
4   105      Eve    服饰   200     4    800

In [3]:
 #数据变形
import pandas as pd
data = {
    'ID': [1, 2],
    'name':['张三','李四'],
    'Math': [90, 85],
    'English': [88, 92],
    'Science': [95, 89]
}
df = pd.DataFrame(data)
df
# df.T

   ID name  Math  English  Science
0   1   张三    90       88       95
1   2   李四    85       92       89

In [7]:
# 宽表转长表
df2 = pd.melt(df,id_vars=['ID','name'],var_name='科目',value_name='分数')
df2.sort_values(by=['name','分数'])

   ID name       科目  分数
2   1   张三  English  88
0   1   张三     Math  90
4   1   张三  Science  95
1   2   李四     Math  85
5   2   李四  Science  89
3   2   李四  English  92

In [10]:
# 长表转宽表
df3 = pd.pivot(df2,index=['ID','name'],columns=['科目'],values='分数')
df3

科目       English  Math  Science
ID name
1  张三         88    90       95
2  李四         92    85       89

In [11]:
# 分列
data = {
    'ID': [1, 2],
    'name':['alice smith','bob jack'],
    'Math': [90, 85],
    'English': [88, 92],
    'Science': [95, 89]
}
df = pd.DataFrame(data)
df

   ID         name  Math  English  Science
0   1  alice smith    90       88       95
1   2     bob jack    85       92       89

In [13]:
df[['first name', 'last name']] = df['name'].str.split(' ')
df

   ID         name  Math  English  Science first name last name
0   1  alice smith    90       88       95      alice       bob
1   2     bob jack    85       92       89      smith      jack

In [16]:
# 加载数据
df = pd.read_csv('data/sleep.csv')
df = df[['person_id','blood_pressure']]
df[['high','low']] = df['blood_pressure'].str.split('/',expand=True)
df

     person_id blood_pressure high low
0            1         124/70  124  70
1            2         131/86  131  86
2            3         122/70  122  70
3            4         124/72  124  72
4            5         133/78  133  78
..         ...            ...  ...  ..
395        396         118/66  118  66
396        397         132/80  132  80
397        398         125/76  125  76
398        399         130/75  130  75
399        400         118/70  118  70

[400 rows x 4 columns]

In [20]:
# 加载数据
df_employees = pd.read_csv('data/employees.csv')
df_employees
df_employees['first_name'] = df_employees['first_name'].str.capitalize()

df_employees['email_domain'] = df_employees['email'].str.extract(r'@(.+)')
df_employees

,employee_id,first_name,last_name,email,phone_number,job_id,salary,commission_pct,manager_id,department_id
0,100,Steven,King,SKING,515.123.4567,AD_PRES,24000.0,NaN,NaN,90.0
1,101,N_ann,Kochhar,NKOCHHAR,515.123.4568,AD_VP,17000.0,NaN,100.0,90.0
2,102,Lex,De Haan,LDEHAAN,515.123.4569,AD_VP,17000.0,NaN,100.0,90.0
3,103,Alexander,Hunold,AHUNOLD,590.423.4567,IT_PROG,9000.0,NaN,102.0,60.0
4,104,Bruce,Ernst,BERNST,590.423.4568,IT_PROG,6000.0,NaN,103.0,60.0
...,...,...,...,...,...,...,...,...,...,...
102,202,Pat,Fay,PFAY,603.123.6666,MK_REP,6000.0,NaN,201.0,20.0
103,203,Susan,Mavris,SMAVRIS,515.123.7777,HR_REP,6500.0,NaN,101.0,40.0
104,204,Hermann,Baer,HBAER,515.123.8888,PR_REP,10000.0,NaN,101.0,70.0
105,205,Shelley,Higgins,SHIGGINS,515.123.8080,AC_MGR,12000.0,NaN,101.0,110.0
106,206,William,Gietz,WGIETZ,515.123.8181,AC_ACCOUNT,8300.0,NaN,205.0,110.0